{"modelTopology": {"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "InputLayer", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 30], "dtype": "float32", "sparse": false, "name": "InputLayer"}, "inbound_nodes": []}, {"name": "D", "class_name": "Dense", "config": {"units": 1000, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "name": "D", "trainable": true}, "inbound_nodes": [[["InputLayer", 0, 0, {}]]]}, {"name": "d", "class_name": "Dense", "config": {"units": 4, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "name": "d", "trainable": true}, "inbound_nodes": [[["D", 0, 0, {}]]]}], "input_layers": [["InputLayer", 0, 0]], "output_layers": [["d", 0, 0]]}, "keras_version": "tfjs-layers 0.7.4", "backend": "tensor_flow.js"}}