{
  "modelTopology": {
    "class_name": "Model",
    "config": {
      "name": "model_1",
      "layers": [
        {
          "name": "input2",
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [
              null,
              1,
              100
            ],
            "dtype": "float32",
            "sparse": false,
            "name": "input2"
          },
          "inbound_nodes": []
        },
        {
          "name": "dense_Dense2",
          "class_name": "Dense",
          "config": {
            "units": 100,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "uniform",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense2",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "input2",
                0,
                0,
                {}
              ]
            ]
          ]
        }
      ],
      "input_layers": [
        [
          "input2",
          0,
          0
        ]
      ],
      "output_layers": [
        [
          "dense_Dense2",
          0,
          0
        ]
      ]
    },
    "keras_version": "tfjs-layers 0.7.4",
    "backend": "tensor_flow.js"
  },
  "weightsManifest": [
    {
      "paths": [
        "./model-1.weights.bin"
      ],
      "weights": [
        {
          "name": "dense_Dense2/kernel",
          "shape": [
            100,
            100
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_Dense2/bias",
          "shape": [
            100
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}