{"dataset": "iris", "is_saved": true, "df": "{\"Category\":{\"sepal_length\":\"numerical\",\"sepal_width\":\"numerical\",\"petal_length\":\"numerical\",\"petal_width\":\"numerical\",\"variety\":\"categorical\"},\"#Unique Values\":{\"sepal_length\":-1,\"sepal_width\":-1,\"petal_length\":-1,\"petal_width\":-1,\"variety\":3},\"(Most frequent, Frequency)\":{\"sepal_length\":[5.0,10],\"sepal_width\":[3.0,26],\"petal_length\":[1.5,13],\"petal_width\":[0.2,29],\"variety\":[\"Versicolor\",50]},\"Defaults\":{\"sepal_length\":5.8,\"sepal_width\":3.0,\"petal_length\":4.35,\"petal_width\":1.3,\"variety\":\"Setosa\"},\"Sample 1\":{\"sepal_length\":5.1,\"sepal_width\":3.5,\"petal_length\":1.4,\"petal_width\":0.2,\"variety\":\"Setosa\"},\"Sample 2\":{\"sepal_length\":4.9,\"sepal_width\":3.0,\"petal_length\":1.4,\"petal_width\":0.2,\"variety\":\"Setosa\"},\"Sample 3\":{\"sepal_length\":4.7,\"sepal_width\":3.2,\"petal_length\":1.3,\"petal_width\":0.2,\"variety\":\"Setosa\"},\"Sample 4\":{\"sepal_length\":4.6,\"sepal_width\":3.1,\"petal_length\":1.5,\"petal_width\":0.2,\"variety\":\"Setosa\"},\"Sample 5\":{\"sepal_length\":5.0,\"sepal_width\":3.6,\"petal_length\":1.4,\"petal_width\":0.2,\"variety\":\"Setosa\"}}", "split": "70,15,15", "train": "70", "test": "15", "validation": "15", "cat_column": ["numerical", "numerical", "numerical", "numerical", "categorical"], "category_list": {"petal_length": "numerical", "petal_width": "numerical", "sepal_length": "numerical", "sepal_width": "numerical", "variety": "categorical"}, "normalize": true, "default_featu": ["petal_length", "petal_width", "sepal_length", "sepal_width", "variety"], "default_column": [4.35, 1.3, 5.8, 3, "Setosa"], "targets": ["variety"], "loss_function": "softmax_cross_entropy", "model": {"modelTopology": {"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "InputLayer_0", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 4], "dtype": "float32", "sparse": false, "name": "InputLayer_0"}, "inbound_nodes": []}, {"name": "Dense_0", "class_name": "Dense", "config": {"units": 100, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "name": "Dense_0", "trainable": true}, "inbound_nodes": [[["InputLayer_0", 0, 0, {}]]]}, {"name": "Dense_1", "class_name": "Dense", "config": {"units": 3, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "name": "Dense_1", "trainable": true}, "inbound_nodes": [[["Dense_0", 0, 0, {}]]]}], "input_layers": [["InputLayer_0", 0, 0]], "output_layers": [["Dense_1", 0, 0]]}, "keras_version": "tfjs-layers 1.1.0", "backend": "tensor_flow.js"}}, "cy_model": {"elements": {"nodes": [{"data": {"name": "InputLayer_0", "class_name": "InputLayer", "root": "Input Layers", "weight": 75, "content": {"input_shape": {"type": "integer_list", "value": "[4]"}, "dtype": {"type": "select", "options": ["float32", "float64", "int32"], "value": "float32"}, "sparse": {"type": "boolean", "value": false}, "class_name": "InputLayer", "name": {"type": "text", "value": "InputLayer_0"}}, "id": "38c33af4-9c04-4a50-9092-6b8a6f232750", "depth": 0}, "position": {"x": 101, "y": 21}, "group": "nodes", "removed": false, "selected": false, "selectable": true, "locked": false, "grabbable": true, "classes": "eh-preview-active"}, {"data": {"name": "Dense_0", "class_name": "Dense", "root": "Core Layers", "weight": 75, "content": {"units": {"type": "integer", "value": 100, "min": 1}, "activation": {"type": "select", "options": ["elu", "hardSigmoid", "linear", "relu", "selu", "sigmoid", "softmax", "softplus", "softsign", "tanh", null], "value": "relu"}, "use_bias": {"type": "boolean", "value": true}, "trainable": {"type": "boolean", "value": true}, "kernel_initializer": {"type": "select", "options": ["glorotNormal", "glorotUniform", "heNormal", "identity", "leCunNormal", "ones", "orthogonal", "randomNormal", "randomUniform", "truncatedNormal", "varianceScaling", "zeros"], "value": "glorotUniform"}, "bias_initializer": {"type": "select", "options": ["glorotNormal", "glorotUniform", "heNormal", "identity", "leCunNormal", "ones", "orthogonal", "randomNormal", "randomUniform", "truncatedNormal", "varianceScaling", "zeros"], "value": "zeros"}, "kernel_constraint": {"type": "select", "options": [null, "maxNorm", "minMaxNorm", "nonNeg", "unitNorm"], "value": null}, "bias_constraint": {"type": "select", "options": [null, "maxNorm", "minMaxNorm", "nonNeg", "unitNorm"], "value": null}, "kernel_regularizer": {"type": "select", "options": [null, "L1L2"], "value": null}, "bias_regularizer": {"type": "select", "options": [null, "L1L2"], "value": null}, "class_name": "Dense", "name": {"type": "text", "value": "Dense_0"}}, "id": "a2932984-f946-4c66-bd75-3efbd2a485d2", "depth": 1}, "position": {"x": 101, "y": 113}, "group": "nodes", "removed": false, "selected": false, "selectable": true, "locked": false, "grabbable": true, "classes": ""}, {"data": {"name": "Dense_1", "class_name": "Dense", "root": "Core Layers", "weight": 75, "content": {"units": {"type": "integer", "value": "3", "min": 1}, "activation": {"type": "select", "options": ["elu", "hardSigmoid", "linear", "relu", "selu", "sigmoid", "softmax", "softplus", "softsign", "tanh", null], "value": "linear"}, "use_bias": {"type": "boolean", "value": true}, "trainable": {"type": "boolean", "value": true}, "kernel_initializer": {"type": "select", "options": ["glorotNormal", "glorotUniform", "heNormal", "identity", "leCunNormal", "ones", "orthogonal", "randomNormal", "randomUniform", "truncatedNormal", "varianceScaling", "zeros"], "value": "glorotUniform"}, "bias_initializer": {"type": "select", "options": ["glorotNormal", "glorotUniform", "heNormal", "identity", "leCunNormal", "ones", "orthogonal", "randomNormal", "randomUniform", "truncatedNormal", "varianceScaling", "zeros"], "value": "zeros"}, "kernel_constraint": {"type": "select", "options": [null, "maxNorm", "minMaxNorm", "nonNeg", "unitNorm"], "value": null}, "bias_constraint": {"type": "select", "options": [null, "maxNorm", "minMaxNorm", "nonNeg", "unitNorm"], "value": null}, "kernel_regularizer": {"type": "select", "options": [null, "L1L2"], "value": null}, "bias_regularizer": {"type": "select", "options": [null, "L1L2"], "value": null}, "class_name": "Dense", "name": {"type": "text", "value": "Dense_1"}}, "id": "04e0e492-dae8-4057-ae0b-947ac605a88a", "depth": 2}, "position": {"x": 101, "y": 205}, "group": "nodes", "removed": false, "selected": false, "selectable": true, "locked": false, "grabbable": true, "classes": "eh-preview-active"}, {"data": {"name": "Loss_0", "class_name": "Loss", "root": "Loss Functions", "weight": 75, "content": {"function": {"type": "select", "options": ["mean_squared_error", "absolute_difference", "cosine_distance", "hinge_loss", "huber_loss", "log_loss", "sigmoid_cross_entropy", "softmax_cross_entropy", "sparse_softmax_cross_entropy", "mean_pairwise_squared_error"], "value": "softmax_cross_entropy"}, "class_name": "Loss", "name": {"type": "text", "value": "Loss_0"}}, "id": "63c984ec-ba34-4bee-bb01-fb76ff8e9947", "depth": 3}, "position": {"x": 101, "y": 297}, "group": "nodes", "removed": false, "selected": true, "selectable": true, "locked": false, "grabbable": true, "classes": "eh-preview-active"}], "edges": [{"data": {"source": "38c33af4-9c04-4a50-9092-6b8a6f232750", "target": "a2932984-f946-4c66-bd75-3efbd2a485d2", "id": "bfb339a1-5a33-4b31-8350-6b54be10a43b"}, "position": {}, "group": "edges", "removed": false, "selected": false, "selectable": true, "locked": false, "grabbable": true, "classes": ""}, {"data": {"source": "a2932984-f946-4c66-bd75-3efbd2a485d2", "target": "04e0e492-dae8-4057-ae0b-947ac605a88a", "id": "34e8f6c4-ebcb-4c2b-bd7f-04c7038224b5"}, "position": {}, "group": "edges", "removed": false, "selected": false, "selectable": true, "locked": false, "grabbable": true, "classes": ""}, {"data": {"source": "04e0e492-dae8-4057-ae0b-947ac605a88a", "target": "63c984ec-ba34-4bee-bb01-fb76ff8e9947", "id": "ec8814ca-90ef-4405-b437-2c981a2bc9aa"}, "position": {}, "group": "edges", "removed": false, "selected": false, "selectable": true, "locked": false, "grabbable": true, "classes": ""}]}, "style": [{"selector": "node", "style": {"text-valign": "center", "color": "white", "width": "200px", "height": "40px", "shape": "roundrectangle"}}, {"selector": "node[root = \"Input Layers\"]", "style": {"background-color": "#8a93ac"}}, {"selector": "node[root = \"Input Layers\"]:selected", "style": {"background-color": "#019ebd"}}, {"selector": "node[root = \"Convolutional Layers\"]", "style": {"background-color": "#939eac"}}, {"selector": "node[root = \"Convolutional Layers\"]:selected", "style": {"background-color": "#019ebd"}}, {"selector": "node[root = \"Merge Layers\"]", "style": {"background-color": "#93a8b6"}}, {"selector": "node[root = \"Merge Layers\"]:selected", "style": {"background-color": "#019ebd"}}, {"selector": "node[root = \"Normalization Layers\"]", "style": {"background-color": "#93a8c0"}}, {"selector": "node[root = \"Normalization Layers\"]:selected", "style": {"background-color": "#019ebd"}}, {"selector": "node[root = \"Pooling Layers\"]", "style": {"background-color": "#93a8ca"}}, {"selector": "node[root = \"Pooling Layers\"]:selected", "style": {"background-color": "#019ebd"}}, {"selector": "node[root = \"Recurrent Layers\"]", "style": {"background-color": "#93a8a2"}}, {"selector": "node[root = \"Recurrent Layers\"]:selected", "style": {"background-color": "#019ebd"}}, {"selector": "node[root = \"Advanced Activations Layers\"]", "style": {"background-color": "#93a898"}}, {"selector": "node[root = \"Advanced Activations Layers\"]:selected", "style": {"background-color": "#019ebd"}}, {"selector": "node[root = \"Core Layers\"]", "style": {"background-color": "#93a88e"}}, {"selector": "node[root = \"Core Layers\"]:selected", "style": {"background-color": "#019ebd"}}, {"selector": "node[root = \"Loss Functions\"]", "style": {"background-color": "#93a8b6"}}, {"selector": "node[root = \"Loss Functions\"]:selected", "style": {"background-color": "#019ebd"}}, {"selector": "node[root = \"Canned Models\"]", "style": {"background-color": "#e29a47", "height": "90px"}}, {"selector": "node[root = \"Canned Models\"]:selected", "style": {"background-color": "#019ebd"}}, {"selector": "edge", "style": {"curve-style": "bezier", "target-arrow-shape": "triangle"}}, {"selector": ".eh-handle", "style": {"background-color": "#666666", "width": "12px", "height": "12px", "shape": "ellipse", "overlay-opacity": "0", "border-width": "12px", "border-opacity": "0"}}, {"selector": ".eh-hover", "style": {"background-color": "#666666"}}, {"selector": ".eh-source", "style": {"border-width": "2px", "border-color": "#666666"}}, {"selector": ".eh-target", "style": {"border-width": "2px", "border-color": "#666666"}}, {"selector": ".eh-preview, .eh-ghost-edge", "style": {"background-color": "#666666", "line-color": "#666666", "target-arrow-color": "#666666", "source-arrow-color": "#666666"}}, {"selector": ".eh-ghost-edge .eh-preview-active", "style": {"opacity": "0"}}, {"selector": ":parent", "style": {"background-opacity": "0.333", "background-color": "#e29a47", "border-width": "2px", "border-color": "#666666"}}, {"selector": "node.cy-expand-collapse-collapsed-node", "style": {"background-color": "#e29a47", "height": "90px"}}, {"selector": ".edgebendediting-hasbendpoints", "style": {"curve-style": "segments", "segment-distances": "fn", "segment-weights": "fn", "edge-distances": "node-position"}}], "zoomingEnabled": true, "userZoomingEnabled": false, "zoom": 1.2, "minZoom": 1e-50, "maxZoom": 1.2, "panningEnabled": true, "userPanningEnabled": true, "pan": {"x": 311.3, "y": 308.70000000000005}, "boxSelectionEnabled": true, "renderer": {"name": "canvas"}}, "mode": "custom", "model_name": "iris_classification"}